function isUpperCase(character) {
    return character === character.toUpperCase();
}

// Ф 1876 хбцё, 7 ырюс, ф 8 1/2 йтдбф фчйчгт
// В 1886 году, 7 ию я, в 8 1/2 часов вечера
let ru_text = 'Фнаёщцчаабч ътсфючаыч Таеба Втфюбфый Йчзбф Таеба Втфюбфый Йчзбф Фнаёщцчаабч ътсфючаыч Ф 1876 хбцё, 7 ырюс, ф 8 1/2 йтдбф фчйчгт, яабр унют атвыдтат вочдт. Чдюы ябыя вгбеыфаыэтя ёхбцаб ъатео чч дбцчгщтаыч, еб фбе баб. Бецтр чхб ат дёц булчдефт ы вчйтеы. Дэбгбвбдеыщатс эбадэтс дячгео, ыюы Фчюыэбцёкыч гёддэбхб атгбцт! Цгтятеыйчдэыь перц ф 1 цчьдефыы Цчьдефёрлыч юыит Юруфыа, ябюбцбь йчюбфчэ. Хгтжыас Жыаыэбфт, чхб юрубфаыит. Хгтж Жыаыэбф, чч яёщ. Аыю Чхбгбф, ыъфбъйыэ № 13326. Цчьдефыч вгбыдзбцые дгчцы учют цас ат Ачфдэбя вгбдвчэеч. Сфючаыч I (Хгтжыас ы Юруфыа чцёе ат ыъфбъйыэч Аыюч Чхбгбфч) Юруфыа(буаыятс). Б, этэ с юруюр ечус! Аб фдч-етэы с ач уёцё ф двбэбч, вбэёцт ян ач цбчцчя цб фбэътют ы ач дсцчя ф фтхба. Йёфдефёче ябч дчгцич, йеб ефбь вбцючи-яёщ угбдыедс дчьйтд ът атяы ф вбхбар. Ё ячас вбцщыюэы егсдёедс. (Аыюё). Вбчъщть дэбгчч, йшге! Хгтжыас. Дэбгчч, ыъфбъйыэ! зюбундаы-эт чч эаёебя! Чъцыео ач ёяччко, эёгыина дна! Аыю(зючлче вб юбктцы). Аб! аб, збючгт! Хбдвбцт ат йть вгыутфсе. Хгтжыас(эгыйые). Етэ чч! Етэ чч! Атщтгыфть, цгсао петэёр, т еб э вбчъцё бвбъцтчя! Юруфыа(буаыятс ы фбдебгхтсдо чч ачъчяабь эгтдбебь). Б, ябс цбгбхтс! Дэбгб, дэбгб ёщч ебе йтд, эбхцт ен уёцчко вгыатцючщтео фдчичюб яач, аб беарцо ач яёщё! (Бхюсцнфтсдо, д ёщтдбя.) Ефбь яёщ цбхбасче атд! С чхб фыщё! Ыъфбъйыэ, вбхбась! Дэбгчь, ячгътфчи, деб йчгечь ечуч ът фбгбеаыэ! (Юёвые Аыют ф двыаё.) Хгтжыас. Вб ътенюэё чхб! Вбдебь, с дтят чхб ъбаеыэбя… (Юёвые.) Аыю(зючлче ыъб фдчз дыю). Аб! Аб! кчфчюыдо, татжчят! (Ыъябгчаатс юбктцо втцтче ы ыъцнзтче.) Юруфыа. Юбктцо ыъцбзют! Б, ёщтд! Ба атд цбхбаые! Аыю. Хбюбфёкэт ябс учцатс, йчя щч с ечвчго эбгяыеодс уёцё? (Вгывтцтче э егёвё юруыябь юбктцы ы гнцтче.) Сфючаыч II Еч щч ы хгтж. Хгтж. Фн учщтео бе ячас?! Дебь! (Зфтетче щчаё ът гёэё.) Ыъячааыит! С юы ечус ач юруыю? С юы ечус ач эбгяыю? Юруфыа(ятюбцёкаб). Ътцтя-эт с дегчэтйт! (Ёучхтче вбц кёя дбугтфкчьдс ебювн.) Хгтж (Аыюё). Ыъфбъйыэ! Дячгео ефбчь юбктцы двтдют ябь дчячьань бйтх бе вбгёхтаыс. Чдюы ун бат ач ыъцбзют фачътваб, еб с ач цбхатю ун учхючибф. Фбе ечуч деб гёуючь! Аыю(фчюыэбцёкаб). Уютхбгбцань хгтж! Ач аёщаб яач фткыз цчачх! Цюс ячас вбдюёщые цбдетебйабь атхгтцбь дбъатаыч, йеб дячгео ябчь юруыябь юбктцы вбдюёщыют э бхгтщцчаыр дчячьанз бдабф! (Фбдзылчаатс ебювт этйтче чхб.) Ътатфчд. Ф 1886 хбцё, 30 жчфгтюс, пет ябс вочдт унют днхгтат ат учгчхё бъчгт Утьэтют юруыечюсяы дичаыйчдэбхб ыдэёддефт. Ебхцт щч с ътвыдтюдс ф йючан Булчдефт Цгтятеыйчдэыз выдтечючь ы вбюёйыю бе этъатйчс Т. Т. Ятьэбфт атцючщтлыь хбабгтг. Убюокч с аыэтэыз вочд ач выдтю ы аыэтэбхб хбабгтгт ач вбюёйтю. Ыетэ, дбдебс йючабя атъфтаабхб Булчдефт ы ыячс вгтфт, дыя ъфтаычя буёдюбфючаанч, с бе ыячаы аткчь втгеыы атдебсечюоаб егчуёр, йебун, фб 1-з, вгчцдчцтечюо, этъатйчь, дчэгчетго ы эбяыече вёуюыйаб вбвгбдыюы ё ячас ыъфыачаыс; фб 2-з, йебун фдч вчгчйыдючаанч цбющабдеанч юыит унюы ътутююбеыгбфтан ы ътячачан йючатяы ыъ аткчь втгеыы; ф 3-з, йебун 25 енд. ыъ хбцбфбхб урцщчет Булчдефт унюы чщчхбцаб тддыхаёчян ат вбэёвэё уыючебф хтяуёгхдэбь юбечгчы ы йебун этщцнь фныхгнк цчюыюдс ячщцё фдчяы йючатяы вбгбфаё; ф 4-з, йебун ат булыз ы пэдегчаанз дбугтаысз Булчдефт ыхгтют фбчаатс яёънэт ы вбцтфтютдо вгыюыйатс ътэёдэт; ф 5-з, етэ этэ фчдо цбзбц Булчдефт вбдеёвтче ф вбюоъё ебюоэб ечз 30 йючабф, вочдн эбебгнз ыцёе ф вгбфыаиыы, ы етэ этэ бдетюоанч 390 йючабф ач вбюёйтре аы хгбкт, ыуб ыз вочдн аыхцч ач ыцёе, еб ф фыцтз двгтфчцюыфбдеы ы гтфабвгтфыс збцтетьдефбфтео вчгчц фндкыя вгтфыечюодефбя, йебун пеыя 30 йючатя унюб ътвгчлчаб детфыео дфбы вочдн ы ечя атгёктео гтфабфчдыч, дебюо ачбузбцыябч цюс абгятюоабхб збцт цчю. Ф ътэюрйчаыч дйыетр аёщаня вгчцёвгчцыео, йеб чдюы збес ат бцыа ыъ бъатйчаанз вёаэебф вбдючцёче бегыитечюоань бефче, еб с фнаёщцча уёцё дюбщыео д дчус ъфтаыч йючат Булчдефт. Йюча Булчдефт цгтятеыйчдэыз выдтечючь ы бвчганз эбявбъыебгбф     Тэтэыь Етгтаеёюбф. Бе гчцтэиыы. Вбячлтс пеб ътсфючаыч вбйечаабхб йючат Булчдефт цгтятеыйчдэыз выдтечючь ы бвчганз эбявбъыебгбф, ян юодеыя дчус атцчщцбр, йеб баб фнъбфче вбюабч дбйёфдефыч вб эгтьачь ячгч ф вбюбфыач цбдебвбйечаанз йючабф пебхб Булчдефт, ътдюёхы эбебгнз дебюо щч фчюыэы, этэ ы ътдюёхы х. Тэтэыс Етгтаеёюбфт. Гёддэтс цгтятеёгхыс – чдео ыячааб ебе фтщань гбц вбпъыы, ф эбебгбя Тэтэыы Етгтаеёюбфн ябхёе вгыбугчдеы ачёфсцтчяёр дютфё бе жыадэыз зютцанз дэтю цб вютячаанз эёюыд, бе вбегсдчаабхб Эгчяюс цб егчдэбеаы булыз дбугтаыь Булчдефт цгтятеыйчдэыз выдтечючь ы бвчганз эбявбъыебгбф…'

let LetterSet = new Set(ru_text.split('').map(e => e.toLowerCase()));
let LetterMap = new Map(Array.from(LetterSet.entries()).map(e => [e[0], 0]));

ru_text.split('').map(e => e.toLowerCase()).forEach(e => {let i = LetterMap.get(e) || 0; LetterMap.set(e, i + 1)});
console.log(Array.from(LetterMap).sort((a,b) => b[1] - a[1]));

let z = [
    ['а', 'н'],
    ['б', 'о'],
    ['в', 'п'],
    ['г', 'р'],
    ['д', 'с'],
    ['е', 'т'],
    ['ё', 'у'],
    ['ж', 'ф'],
    ['з', 'х'],
    ['и', 'ц'],
    ['й', 'ч'],
    ['к', 'ш'],
    ['л', 'щ'],
    ['м', 'ъ'],
    ['н', 'ы'],
    ['о', 'ь'],
    ['п', 'э'],
    ['р', 'ю'],
    ['с', 'я'],
    ['т', 'а'],
    ['у', 'б'],
    ['ф', 'в'],
    ['х', 'г'],
    ['ц', 'д'],
    ['ч', 'е'],
    ['ш', 'ё'],
    ['щ', 'ж'],
    ['ъ', 'з'],
    ['ы', 'и'],
    ['ь', 'й'],
    ['э', 'к'],
    ['ю', 'л'],
    ['я', 'м'],
];
let zMap = new Map(z);

console.log(
    ru_text.split('').map(ch => {
        let e = ch.toLowerCase();
        if (zMap.has(e)) {
            if (isUpperCase(ch)) {
                return zMap.get(e).toUpperCase()
            } else {
                return zMap.get(e)
            }
        }
        return ch
    }).join('')
);